## Q1
- ì—¬ëŸ¬ë¶„ì€ íŒŒì´ì¬ì„ í†µí•´ ì„¤ë¬¸ì¡°ì‚¬ ë¬¸í•­ì˜ ì‘ë‹µë‚´ì—­ì„ ë¶„ì„í•˜ê²Œ ë˜ì—ˆìŠµë‹ˆë‹¤. ë¬¸í•­ë³„ ì‘ë‹µë‚´ìš©ì—ëŠ” í•˜ë‚˜ì˜ ì‘ë‹µë§Œ í•  ìˆ˜ ìˆëŠ” single choice ë¬¸ì œì™€ ì—¬ëŸ¬ ì‘ë‹µì„ ì„ íƒí•  ìˆ˜ ìˆëŠ” multiple choice ë¬¸ì œê°€ ìˆìŠµë‹ˆë‹¤. 2ê°œë¥¼ êµ¬ë¶„í•˜ê¸° ìœ„í•´ single choice ë¬¸í•­ ë²ˆí˜¸ì— "_"ë¥¼ í‘œê¸°í•˜ì§€ ì•Šê¸°ë¡œ í–ˆìŠµë‹ˆë‹¤.

- ë¬¸í•­ë³„ ì‘ë‹µë‚´ì—­ì´ 'question'ì— ë‹´ê²¨ ìˆì„ ë•Œ, ì¡°ê±´ë¬¸ê³¼ ë°˜ë³µë¬¸ì„ ì‚¬ìš©í•˜ì—¬ ì•„ë˜ì™€ ê°™ì€ ê²°ê³¼ê°€ ì¶œë ¥ë˜ë„ë¡ ì½”ë“œë¥¼ ì‘ì„±í•´ë³´ì„¸ìš”.

In [9]:
question = ['Q2', 'Q3', 'Q4', 'Q5', 'Q6_1', 'Q6_2', 'Q6_3', 'Q6_4', 'Q6_5', 'Q6_6',
       'Q6_7', 'Q6_8', 'Q6_9', 'Q6_10', 'Q6_11', 'Q6_12', 'Q7_1', 'Q7_2',
       'Q7_3', 'Q7_4', 'Q7_5', 'Q7_6', 'Q7_7', 'Q8', 'Q9', 'Q10_1', 'Q10_2',
       'Q10_3']

single_choice = ['Q2', 'Q3', 'Q4', 'Q5', 'Q8', 'Q9']
multiple_choice = ['Q6_1', 'Q6_2', 'Q6_3', 'Q6_4', 'Q6_5', 'Q6_6', 'Q6_7', 'Q6_8', 'Q6_9', 'Q6_10', 'Q6_11', 'Q6_12', 'Q7_1', 'Q7_2', 'Q7_3', 'Q7_4', 'Q7_5', 'Q7_6', 'Q7_7', 'Q10_1', 'Q10_2', 'Q10_3']

choice = input("")

if choice in single_choice:
    print(single_choice)
elif choice in multiple_choice:
    print(multiple_choice)
else:
    print("ì˜ëª»ëœ ì„ íƒì…ë‹ˆë‹¤. 'single' ë˜ëŠ” 'multiple' ì¤‘ì—ì„œ ì„ íƒí•˜ì„¸ìš”.")

Q2
['Q2', 'Q3', 'Q4', 'Q5', 'Q8', 'Q9']

## Q2
- í•œìŠ¤ ë¡œìŠ¬ë§(Hans Rosling, 1948ë…„ 7ì›” 27ì¼ ~ 2017ë…„ 2ì›” 7ì¼)ì€ ìŠ¤ì›¨ë´ì˜ ì˜ì‚¬ì´ì í†µê³„í•™ìë¡œ ë¹„ì˜ë¦¬ ë²¤ì²˜ ê°­ë§ˆì¸ë” ì¬ë‹¨ì˜ ê³µë™ì„¤ë¦½ìì´ê¸°ë„ í•©ë‹ˆë‹¤. ë¹…ë°ì´í„°ë¥¼ ê°€ì¥ ì˜ í™œìš©í•˜ëŠ” ë³´ê±´ í†µê³„í•™ìë¡œ ì•Œë ¤ì ¸ ìˆìŠµë‹ˆë‹¤. ë² ìŠ¤íŠ¸ì…€ëŸ¬ ì±…ì¸ "íŒ©íŠ¸í’€ë‹ˆìŠ¤" ì €ìì´ê¸°ë„ í•©ë‹ˆë‹¤. ê°­ë§ˆì¸ë” ì‚¬ì´íŠ¸ì—ì„œëŠ” ì—°ë„ë³„, êµ­ê°€ë³„ GDPì™€ ê¸°ëŒ€ìˆ˜ëª… ë°ì´í„°ë¥¼ ì œê³µí•˜ê³  ìˆëŠ”ë°, ëŒ€í‘œì ìœ¼ë¡œ íŒŒì´ì¬ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì¤‘ 'seaborn'ì—ì„œ ì œê³µë˜ëŠ” ì˜ˆì œ ë°ì´í„°ê°€ ìˆìŠµë‹ˆë‹¤. ì˜¤ëŠ˜ì€ ì´ ë°ì´í„°ë¥¼ í™œìš©í•´ ë¬¸ì œë¥¼ í’€ì–´ë³´ê² ìŠµë‹ˆë‹¤.
- ë‹¤ìŒì˜ ë°ì´í„°ëŠ” ì—°ë„, êµ­ê°€ë³„ ê¸°ëŒ€ìˆ˜ëª…ì„ ë‚˜íƒ€ë‚´ê³  ìˆëŠ” ë°ì´í„° ì…ë‹ˆë‹¤. 2011ë…„ ë¶€í„°ì˜ ì—°ë„ë³„, êµ­ê°€ë³„ í‰ê·  ê¸°ëŒ€ìˆ˜ëª…ì„ êµ¬í•´ì£¼ì„¸ìš”. (2011ë…„ë„ í¬í•¨ë˜ê²Œ êµ¬í•©ë‹ˆë‹¤.)

- [í•„ìˆ˜ ì¡°ê±´] groupby ë‚˜ pivot_tableì„ í™œìš©í•©ë‹ˆë‹¤. groupby ë¡œ êµ¬í•  ë•Œ unstack()ì´ë¼ëŠ” ê¸°ëŠ¥ì„ ì‚¬ìš©í•˜ì—¬ ì•„ë˜ì™€ ê°™ì´ ì»¬ëŸ¼ì— ì¸ë±ìŠ¤ ê°’ì„ ì˜¬ë ¤ì„œ í‘œê¸°í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.
- ë§Œì•½ í–‰ì—ëŠ” 'ì—°ë„'ê°€, ì—´ì— 'êµ­ê°€'ê°€ ë“¤ì–´ìˆê³  ìˆ˜ì¹˜ ë°ì´í„°ì˜ ê²°ê³¼ê°’ì´ ì•„ë˜ì™€ ê°™ë‹¤ë©´, ì¶œë ¥í˜•íƒœëŠ” ì¡°ê¸ˆ ë‹¬ë¼ë„ ê´œì°®ìŠµë‹ˆë‹¤.

In [10]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/healthexp.csv")
df

     Year        Country  Spending_USD  Life_Expectancy
0    1970        Germany       252.311             70.6
1    1970         France       192.143             72.2
2    1970  Great Britain       123.993             71.9
3    1970          Japan       150.437             72.0
4    1970            USA       326.961             70.9
..    ...            ...           ...              ...
269  2020        Germany      6938.983             81.1
270  2020         France      5468.418             82.3
271  2020  Great Britain      5018.700             80.4
272  2020          Japan      4665.641             84.7
273  2020            USA     11859.179             77.0

[274 rows x 4 columns]

In [11]:
df_x = df[(df['Year'] >= 2011)]
df_sp= df_x.pivot_table(index='Year', columns='Country', values='Life_Expectancy')
df_sp.columns.name = None

df_sp

      Canada  France  Germany  Great Britain  Japan   USA
Year
2011    81.4    82.3     80.5           81.0   82.7  78.7
2012    81.6    82.1     80.6           81.0   83.2  78.8
2013    81.7    82.3     80.6           81.1   83.4  78.8
2014    81.8    82.8     81.2           81.4   83.7  78.9
2015    81.9    82.4     80.7           81.0   83.9  78.7
2016    82.0    82.7     81.0           81.2   84.1  78.7
2017    81.9    82.7     81.1           81.3   84.2  78.6
2018    82.0    82.8     81.0           81.3   84.3  78.7
2019    82.2    82.9     81.3           81.4   84.4  78.8
2020    81.7    82.3     81.1           80.4   84.7  77.0

## ğŸ“ŒQ3. Jupyter notebook ì€ ë¬¸ì„œì™€ ì½”ë“œë¥¼ í•¨ê»˜ ì‘ì„±í•  ìˆ˜ ìˆë‹¤ëŠ” ì ì´ ì¥ì ì…ë‹ˆë‹¤. Jupyter notebook ì—ì„œ ì§€ì›í•˜ëŠ” Markdown ë¬¸ë²•ì„ ì‚¬ìš©í•˜ì—¬, ì´ë²ˆ ì£¼ì— ë°°ìš´ ë‚´ìš©ì„ ì •ë¦¬í•´ ë³´ì„¸ìš”!

- Pandasë¥¼ í†µí•œ íŒŒì¼ ì €ì¥ê³¼ ë¶ˆëŸ¬ì˜¤ê¸°
    - to_csv("íŒŒì¼ëª…", index=False) : csv íŒŒì¼ë¡œ ì €ì¥í•˜ê¸°
    - read_csv("íŒŒì¼ëª…") : csv íŒŒì¼ ë¶ˆëŸ¬ì˜¤ê¸°
    - shapeë¥¼ í†µí•œ í–‰ê³¼ ì—´ì˜ ìˆ˜ ë³´ê¸°
    - head, tail, sample ì„ í†µí•œ ì¼ë¶€ ë°ì´í„° ê°€ì ¸ì˜¤ê¸°

In [12]:
import pandas as pd
df_x = pd.DataFrame(df)

In [13]:
# to_csv("íŒŒì¼ëª…", index=False) : csv íŒŒì¼ë¡œ ì €ì¥í•˜ê¸°
df.to_csv('df_sp',index=False)

In [14]:
# read_csv("íŒŒì¼ëª…") : csv íŒŒì¼ ë¶ˆëŸ¬ì˜¤ê¸°
df_load = pd.read_csv("df_sp")

In [15]:
# shapeë¥¼ í†µí•œ í–‰ê³¼ ì—´ì˜ ìˆ˜ ë³´ê¸°
df_load.shape

(274, 4)

In [16]:
# head
df_head = df_load.head(2)
df_head

   Year  Country  Spending_USD  Life_Expectancy
0  1970  Germany       252.311             70.6
1  1970   France       192.143             72.2

In [17]:
# tail
df_tail = df_load.tail(2)
df_tail

     Year Country  Spending_USD  Life_Expectancy
272  2020   Japan      4665.641             84.7
273  2020     USA     11859.179             77.0

In [18]:
# sample
df_sample = df_load.sample(2)
df_sample

    Year Country  Spending_USD  Life_Expectancy
39  1980  France       659.826             74.3
56  1983   Japan       714.857             77.0

- DataFrameì˜ info(), describe() ë“±ì„ í†µí•œ ìš”ì•½ê³¼ ê¸°ìˆ í†µê³„ ê°’ êµ¬í•˜ê¸°
    - info()
    - describe()
    - nunique()
    - index
    - columns
    - values

In [19]:
# info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 274 entries, 0 to 273
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Year             274 non-null    int64
 1   Country          274 non-null    object
 2   Spending_USD     274 non-null    float64
 3   Life_Expectancy  274 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 8.7+ KB

In [20]:
# describe()
df.describe()

              Year  Spending_USD  Life_Expectancy
count   274.000000    274.000000       274.000000
mean   1996.992701   2789.338905        77.909489
std      14.180933   2194.939785         3.276263
min    1970.000000    123.993000        70.600000
25%    1985.250000   1038.357000        75.525000
50%    1998.000000   2295.578000        78.100000
75%    2009.000000   4055.610000        80.575000
max    2020.000000  11859.179000        84.700000

In [21]:
# index
df_a = df.nunique()
df_a

Year                51
Country              6
Spending_USD       274
Life_Expectancy    118
dtype: int64

In [22]:
# columns
df.columns

Index(['Year', 'Country', 'Spending_USD', 'Life_Expectancy'], dtype='object')

In [23]:
# values
df.values

array([[1970, 'Germany', 252.311, 70.6],
       [1970, 'France', 192.143, 72.2],
       [1970, 'Great Britain', 123.993, 71.9],
       ...,
       [2020, 'Great Britain', 5018.7, 80.4],
       [2020, 'Japan', 4665.641, 84.7],
       [2020, 'USA', 11859.179, 77.0]], dtype=object)

- Pandasì˜ DataFrameê³¼ Seriesì˜ ì´í•´
    - Series : 1ì°¨ì› ë²¡í„°êµ¬ì¡°
    - DataFrame : 2ì°¨ì› í–‰ë ¬êµ¬ì¡°

In [24]:
df_1 = [1,2,3]
series = pd.Series(df_a)

In [25]:
series

Year                51
Country              6
Spending_USD       274
Life_Expectancy    118
dtype: int64

In [26]:
df_2 = {'a':[1,2,3,4],'b':[5,6,7,8],'c':[9,10,11,12]}
df_2 = pd.DataFrame(df_2)

In [27]:
df_2

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

- ìƒ‰ì¸í•˜ê¸°
    - [ì»¬ëŸ¼]
    - .loc[í–‰]
    - .loc[í–‰, ì—´]
    - .loc[ì¡°ê±´ì‹, ì—´]

In [28]:
# ì»¬ëŸ¼
df_column = df_2['a']
df_column

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [29]:
# .loc[í–‰]
df_2.loc[3]

a     4
b     8
c    12
Name: 3, dtype: int64

In [30]:
# .loc[í–‰, ì—´]
df_2.loc[3, 'a']

4

In [31]:
# .loc[ì¡°ê±´ì‹, ì—´]
df_2.loc[df_2['a'] > 2, 'b']

2    7
3    8
Name: b, dtype: int64

- DataFrameì˜ ë°ì´í„° íƒ€ì… ì´í•´í•˜ê¸°
    - ë‚ ì§œ ë°ì´í„°ì˜ ë³€í™˜

In [32]:
df_2.dtypes

a    int64
b    int64
c    int64
dtype: object

In [33]:
df_2['a'] = pd.to_datetime(df_2['a'])
df_2.dtypes

a    datetime64[ns]
b             int64
c             int64
dtype: object

- DataFrame ë‹¤ë£¨ê¸°
    - ì—´(column) ì¸ë±ì‹±
    - í–‰(index) ì¸ë±ì‹±
    - í–‰, ì—´ ì¸ë±ì‹±
    - ì •ë ¬í•˜ê¸° : sort_values ì‚¬ìš©í•˜ê¸°
    - ì¡°ê±´ì‹ ì‚¬ìš©í•˜ê¸°

In [34]:
# ì—´(column) ì¸ë±ì‹±
df_A = df_2['b']
df_A

0    5
1    6
2    7
3    8
Name: b, dtype: int64

In [35]:
# í–‰(index) ì¸ë±ì‹±
df_B = df_2.loc[3]
df_B

a    1970-01-01 00:00:00.000000004
b                                8
c                               12
Name: 3, dtype: object

In [36]:
# í–‰, ì—´ ì¸ë±ì‹±
df_C = df_2.loc[1, 'b']
df_C

6

In [37]:
# ì •ë ¬í•˜ê¸° : sort_values ì‚¬ìš©í•˜ê¸°
df_sort = df_2.sort_values(by='b', ascending=False)
df_sort

                              a  b   c
3 1970-01-01 00:00:00.000000004  8  12
2 1970-01-01 00:00:00.000000003  7  11
1 1970-01-01 00:00:00.000000002  6  10
0 1970-01-01 00:00:00.000000001  5   9

In [38]:
# ì¡°ê±´ì‹ ì‚¬ìš©í•˜ê¸°
df_filter = df_2[df_2['b'] > 5]
df_filter

                              a  b   c
1 1970-01-01 00:00:00.000000002  6  10
2 1970-01-01 00:00:00.000000003  7  11
3 1970-01-01 00:00:00.000000004  8  12

- ë¹ˆë„ìˆ˜ êµ¬í•˜ê¸°
    - í•œ ê°œì˜ ë³€ìˆ˜ : series.value_counts()
    - ë‘ ê°œì˜ ë³€ìˆ˜ : pd.crosstab()

In [39]:
# í•œ ê°œì˜ ë³€ìˆ˜ : series.value_counts()
series = df_2['c']
frequency = series.value_counts()
frequency

9     1
10    1
11    1
12    1
Name: c, dtype: int64

In [40]:
# ë‘ ê°œì˜ ë³€ìˆ˜ : pd.crosstab()
cross_tab = pd.crosstab(df_2['b'], df_2['c'])
cross_tab

c  9   10  11  12
b
5   1   0   0   0
6   0   1   0   0
7   0   0   1   0
8   0   0   0   1

- groupby ì™€ pivot_table
    - ë‹¤ì–‘í•œ ì—°ì‚°ì‹ì˜ ì‚¬ìš©

In [41]:
group = df_2.groupby('b')['c'].mean()
group

b
5     9.0
6    10.0
7    11.0
8    12.0
Name: c, dtype: float64

In [42]:
pivot = df_2.pivot_table(index='b', values='c', aggfunc='mean')
pivot

    c
b
5   9
6  10
7  11
8  12

## ğŸ“ŒQ4. ì•ìœ¼ë¡œ ìš°ë¦¬ëŠ” ê³µê³µë°ì´í„°í¬í„¸ì—ì„œ ë°ì´í„°ë¥¼ ë‹¤ìš´ë¡œë“œ ë°›ì•„ ê³¼ì •ì„ ì§„í–‰í•  ì˜ˆì •ì…ë‹ˆë‹¤. ë³¸ê²©ì ì¸ í•™ìŠµ ì´ì „ì—! ë°ì´í„°ë¥¼ ë‹¤ë£¨ëŠ” ë°©ë²•ì´ ìµìˆ™í•´ì§€ë„ë¡ í•œë²ˆ ë” ì—°ìŠµí•´ë³´ê³ , ì–´ë–¤ ë¬¸ì œë¥¼ í’€ ìˆ˜ ìˆì„ì§€ë„ í•¨ê»˜ ê³ ë¯¼í•´ë³´ì•„ìš”!

- ê³µê³µë°ì´í„°í¬í„¸ì—ì„œ ì›í•˜ëŠ” ë°ì´í„°ë¥¼ ë‹¤ìš´ë¡œë“œ ë°›ì•„ ê²½ë¡œë¥¼ ì„¤ì •í•˜ê³ , ì£¼í”¼í„° ë…¸íŠ¸ë¶ê³¼ íŒë‹¤ìŠ¤ë¥¼ í†µí•´ ë¶ˆëŸ¬ì™€ ë³´ì„¸ìš”! ì–´ë–¤ ë°ì´í„°ë¥¼ ì‚¬ìš©í•´ì•¼í• ì§€ ê³ ë¯¼ëœë‹¤ë©´ ë‹¤ìŒ ë§í¬ì˜ ë°ì´í„°ë¥¼ ë‹¤ìš´ë¡œë“œ ë°›ì•„ë„ ì¢‹ìŠµë‹ˆë‹¤.
- ì´ ë•Œ, ì¸ì½”ë”© ì˜¤ë¥˜ê°€ ë°œìƒí•œë‹¤ë©´ encoding="cp949" ì˜µì…˜ì„ ì‚¬ìš©í•´ ì£¼ì„¸ìš”! cp949ëŠ” í•œê¸€ ìœˆë„ìš°ì—ì„œ ì‚¬ìš©í•˜ëŠ” ì¸ì½”ë”© ë°©ì‹ì´ëë‹ˆë‹¤. ì¸ì½”ë”©ê³¼ ê´€ë ¨ëœ ìì„¸í•œ ë‚´ìš©ì€ ë‹¤ìŒì„ ì°¸ê³ í•´ ì£¼ì„¸ìš”.

In [56]:
%pwd

'C:\\Users\\jh060\\ë°ì´í„° ë¶„ì„\\ë¶€ìŠ¤íŠ¸ì½”ìŠ¤'

In [64]:
data = pd.read_csv("Data/ì„œìš¸íŠ¹ë³„ì‹œ ê°•ë‚¨êµ¬_ìƒí™œíê¸°ë¬¼ë°°ì¶œëŸ‰_20221019.csv", encoding="cp949")